# SetThreeStateCheckBoxState

## Description
Sets the state of a Layout Manager three state checkbox.

```pascal
PROCEDURE SetThreeStateCheckBoxState(
				dialogID    : LONGINT;
				componentID : LONGINT;
				iState      : INTEGER);
```

```python

def vs.SetThreeStateCheckBoxState(dialogID, componentID, iState):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|componentID|LONGINT||
|iState|INTEGER||

## Version
Availability: from VectorWorks12.5
## Category
* Dialogs - Modern